gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/server.cpp
      // get char and add to appropriate string
      if (isTime==1){
        DataTime+= c;
      } else {
        DataValue+= c;
      }
    }
    //noValues ++;
  }
  file.close();

  // enclose the generated strings with necessary brakets
  firstRun = 0;
  message += messageLine;

  message += "]);";

   message += "\
  // Set Options\n \
  const options = {\
    title: 'Wasserstand Zehentner Teisendorf',\
    hAxis: {title: 'Datum/Zeit'},\
    vAxis: {title: 'Wasserstamd [cm]'},\
    legend: 'none'\
  }; ";
  

   message += "\
  // Draw Chart \n \
  const chart = new google.visualization.LineChart(document.getElementById('ShortTermChart'));\
  chart.draw(data, options);\
  }\
  </script>\
  ";
  

  addBottom(message);

  Serial.print("message: "); 
  Serial.println(message.length());

  server.send(200, "text/html", message);
  
}
//*********************************************************************************
void handleCss()
//*********************************************************************************
{
  // output of stylesheet
  // this is a straight forward example how to generat a static page from program memory
  String message;
  message = F("*{font-family:sans-serif}"
              "body{margin:10px}"
              "h1, h2{color:white;background:" CSS_MAINCOLOR ";text-align:center}"
              "h1{font-size:1.2em;margin:1px;padding:5px}"
              "h2{font-size:1.0em}"
              "h3{font-size:0.9em}"
              "p{color: black;}"
              "a{text-decoration:none;color:dimgray;text-align:center}"
              "main{text-align:center}"
              "article{vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:#E5E5E5;width:20em;text-align:left}" // if you don't like the floating effect (vor portrait mode on smartphones!) - remove display:inline-block
              "article h2{margin-top:0;padding-bottom:1px}"
              "section {margin-bottom:0.2em;clear:both;}"
              "table{border-collapse:separate;border-spacing:0 0.2em}"
              "th, td{background-color:#C0C0C0}"
              "button{margin-top:0.3em}"
              "footer p{font-size:0.8em;color:dimgray;background:silver;text-align:center;margin-bottom:5px}"
              "nav{background-color:silver;margin:1px;padding:5px;font-size:0.8em}"
              "nav a{color:dimgrey;padding:10px;text-decoration:none}"
              "nav a:hover{text-decoration:underline}"
              "nav p{margin:0px;padding:0px}"
              ".on_red, .on_green, .off{margin-top:0;margin-bottom:0.2em;margin-left:4em;font-size:1.4em;border-style:solid;border-radius:10px;border-style:outset;width:5em;height:1.5em;text-decoration:none;text-align:center}"
              ".off{color:black;background-color:gray;border-color:grey}"
              ".on_red{background-color:red;border-color:red}"
              ".on_green{background-color:green;border-color:green}"
              "message_ok  {color:white;vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:green ;width:19em;text-align:center}"
              "message_warn{color:white;vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:orange;width:19em;text-align:center}"
              "message_err {color:white;vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:red   ;width:19em;text-align:center}"
              // //=========================================================================
              // ".slidecontainer {"
              // "  width: 100%; /* Width of the outside container */"
              // "}"
              // ""
              // "/* The slider itself */"
              // ".slider {"
              // "  -webkit-appearance: none;  /* Override default CSS styles */"
              // "  appearance: none;"
              // "  width: 100%; /* Full-width */"
              // "  height: 25px; /* Specified height */"
              // "  background: #d3d3d3; /* Grey background */"
              // "  outline: none; /* Remove outline */"
              // "  opacity: 0.7; /* Set transparency (for mouse-over effects on hover) */"
              // "  -webkit-transition: .2s; /* 0.2 seconds transition on hover */"
              // "  transition: opacity .2s;"
              // "}"
              // ""
              // "/* Mouse-over effects */"
              // ".slider:hover {"
              // "  opacity: 1; /* Fully shown on mouse-over */"
              // "}"
              // ""
              // "/* The slider handle (use -webkit- (Chrome, Opera, Safari, Edge) and -moz- (Firefox) to override default look) */"
              // ".slider::-webkit-slider-thumb {"
              // "  -webkit-appearance: none; /* Override default look */"
              // "  appearance: none;"
              // "  width: 25px; /* Set a specific slider handle width */"
              // "  height: 25px; /* Slider handle height */"
              // "  background: #04AA6D; /* Green background */"
              // "  cursor: pointer; /* Cursor on hover */"
              // "}"
              // ""
              // ".slider::-moz-range-thumb {"
              // "  width: 25px; /* Set a specific slider handle width */"
              // "  height: 25px; /* Slider handle height */"
              // "  background: #04AA6D; /* Green background */"
              // "  cursor: pointer; /* Cursor on hover */"
              // "}"
              // ""
              //=========================================================================
              
              );
  server.send(200, "text/css", message);
}

//*********************************************************************************
// Output: send data to browser as JSON
// after modification always check if JSON is still valid. Just call the JSON (json) in your webbrowser and check.
void handleJson()
{
//*********************************************************************************
  //  Serial.println(F("D268 requested json"));
  String message = "";
  message = (F("{\"ss\":")); // Start of JSON and the first object "ss":
  message += millis() / 1000;
  message += (F(",\"val_AHH\":"));
  message += digitalRead(GPin_AHH);
  message += (F(",\"val_AH\":"));
  message += digitalRead(GPin_AH);
  message += (F(",\"val_AL\":"));
  message += digitalRead(GPin_AL);
  // message += (F(",\"val_ALL\":"));
  // message += digitalRead(GPin_ALL);
  message += (F("}"));                           // End of JSON
  server.send(200, "application/json", message); // set MIME type https://www.ietf.org/rfc/rfc4627.txt
}

//*********************************************************************************
// Output: a fetch API / JavaScript
// a function in the JavaScript uses fetch API to request a JSON file from the webserver and updates the values on the page if the object names and ID are the same
void handleJs()
//*********************************************************************************
{
  /* =======================================*/
  String message;
  message += F("const url ='json';\n"
               "function renew(){\n"
               " document.getElementById('sec').style.color = 'blue'\n" // if the timer starts the request, the second gets blue
               " fetch(url)\n"                                          // Call the fetch function passing the url of the API as a parameter
               " .then(response => {return response.json();})\n"
               " .then(jo => {\n"
               "   document.getElementById('sec').innerHTML = Math.floor(jo['ss'] % 60);\n" // example how to change a value in the HTML page
               "   for (var i in jo)\n"
               "    {if (document.getElementById(i)) document.getElementById(i).innerHTML = jo[i];}\n" // as long as the JSON name fits to the HTML id, the value will be replaced
               // add other fields here (e.g. the delivered JSON name doesn't fit to the html id
               // finally, update the runtime
               "   if (jo['ss'] > 60) { document.getElementById('min').innerHTML = Math.floor(jo['ss'] / 60 % 60);}\n"
               "   if (jo['ss'] > 3600) {document.getElementById('hour').innerHTML = Math.floor(jo['ss'] / 3600 % 24);}\n"
               "   if (jo['ss'] > 86400) {document.getElementById('day').innerHTML = Math.floor(jo['ss'] / 86400 % 7);}\n"
               "   if (jo['ss'] > 604800) {document.getElementById('week').innerHTML = Math.floor(jo['ss'] / 604800 % 52);}\n"
               "   document.getElementById('sec').style.color = 'dimgray';\n" // if everything was ok, the second will be grey again.
               " })\n"
               " .catch(function() {\n" // this is where you run code if the server returns any errors
               "  document.getElementById('sec').style.color = 'red';\n"
               " });\n"
               "}\n"
               "document.addEventListener('DOMContentLoaded', renew, setInterval(renew, ");
  message += ajaxIntervall * 1000;
  message += F("));");

